{"type":"data","nodes":[null,{"type":"data","data":[{"prev":1,"next":4,"section":7},{"slug":2,"title":3},"cs\u002Fvscode","VS Code",{"slug":5,"title":6},"cs\u002Fmodulefiles","Modulefiles",{"file":8,"title":9,"date":10,"summary":-1,"tag":11,"toc":14,"body":15},"cs\u002F23-ipmitool.md","IPMI","Nov. 29, 2020",[12,13],"server","tool","\u003Ch4\u003EContents\u003C\u002Fh4\u003E\u003Cp class=\"toc-h3\"\u003E\u003Ca href=\"#ipmi-interface\"\u003EIPMI interface\u003C\u002Fa\u003E\u003C\u002Fp\u003E\u003Cp class=\"toc-h3\"\u003E\u003Ca href=\"#wake-on-lan\"\u003Ewake on LAN\u003C\u002Fa\u003E\u003C\u002Fp\u003E","\u003Ch3 id=\"ipmi-interface\"\u003EIPMI interface\u003Ca href=\"#ipmi-interface\" class=\"anchor\"\u003E\u003Cspan class=\"visually-hidden\"\u003E#\u003C\u002Fspan\u003E\u003C\u002Fa\u003E\u003C\u002Fh3\u003E\u003Cul\u003E\n\u003Cli\u003E\u003Ca href=\"https:\u002F\u002Fserverfault.com\u002Fa\u002F362019\"\u003Ehttps:\u002F\u002Fserverfault.com\u002Fa\u002F362019\u003C\u002Fa\u003E\u003C\u002Fli\u003E\n\u003C\u002Ful\u003E\n\u003Cp\u003E\u003Cstrong\u003EDedicated\u003C\u002Fstrong\u003E: Always use the dedicated IPMI interface. This is the option you want if you’re trying to have the simplest setup, at the expense of additional cabling.\u003C\u002Fp\u003E\n\u003Cp\u003E\u003Cstrong\u003EShared\u003C\u002Fstrong\u003E: Always use the LAN1 interface. This is the option you want if you’re trying to reduce your cabling to each server, and understand the tradeoffs. Under the covers, there’s a virtual switch in hardware that’s splitting out traffic to the IPMI card from traffic to the rest of the system; the IPMI card has a separate MAC address to differentiate the traffic. On modern Supermicro boards, you can also set the IPMI traffic to run on a different VLAN from the rest of the system, so you can tag the IPMI traffic. There are some definite security implication to this design; it’s not difficult for the main system to access the IPMI network, if you were trying to keep them separated. A failure of the LAN1 interface often means that you lose primary and out-of-band connectivity at the same time.\u003C\u002Fp\u003E\n\u003Cp\u003E\u003Cstrong\u003EFailover\u003C\u002Fstrong\u003E (factory default): On boot, detect if the dedicated IPMI interface is connected. If so, use the dedicated interface, otherwise fall back to the shared LAN1. I’ve never found a good use for this option. As best I can tell, this setup is fundamentally flawed - I haven’t tested it extensively, but I’ve heard reports it’ll fail to detect the dedicated interface in many circumstances because the upstream switch isn’t passing traffic - for example, after a power outage if the switch and system come up simultaneously, or if the switch is still blocking during the spanning tree detection. Combine this with the fact that the check only happens at boot, and it’s just generally hard to control what interface you end up using.\u003C\u002Fp\u003E\n\u003Cp\u003E한줄 요약: Hub LAN port와 케이블이 충분하면 \u003Cstrong\u003EDedicated\u003C\u002Fstrong\u003E를 사용하고, 효율적으로 사용을 원하면 \u003Cstrong\u003EShared\u003C\u002Fstrong\u003E를 사용하면 된다.\u003C\u002Fp\u003E\n\u003Cul\u003E\n\u003Cli\u003E\u003Ca href=\"https:\u002F\u002Fserverfault.com\u002Fa\u002F677087\"\u003Ehttps:\u002F\u002Fserverfault.com\u002Fa\u002F677087\u003C\u002Fa\u003E\u003C\u002Fli\u003E\n\u003C\u002Ful\u003E\n\u003Cp\u003EThe following raw commands will surely prove useful to the next person who reads this topic. I got these directly from Supermicro support. Cheers:\u003C\u002Fp\u003E\n\u003Cp\u003ETo get LAN mode: \u003Ccode\u003Eipmitool raw 0x30 0x70 0x0c 0\u003C\u002Fcode\u003E.\u003C\u002Fp\u003E\n\u003Cp\u003ETo set LAN mode dedicated: \u003Ccode\u003Eipmitool raw 0x30 0x70 0x0c 1 0\u003C\u002Fcode\u003E.\u003C\u002Fp\u003E\n\u003Cp\u003ETo set LAN mode onboard\u002Fshared: \u003Ccode\u003Eipmitool raw 0x30 0x70 0x0c 1 1\u003C\u002Fcode\u003E.\u003C\u002Fp\u003E\n\u003Cp\u003ETo set LAN mode failover: \u003Ccode\u003Eipmitool raw 0x30 0x70 0x0c 1 2\u003C\u002Fcode\u003E.\u003C\u002Fp\u003E\n\u003Cp\u003EThese raw values will also work with \u003Ccode\u003Eipmicfg\u003C\u002Fcode\u003E (just remember to use \u003Ccode\u003E-raw\u003C\u002Fcode\u003E instead of \u003Ccode\u003Eraw\u003C\u002Fcode\u003E).\u003C\u002Fp\u003E\n\u003Cp\u003EAfter setting the required LAN mode, do not forget to do a hard reboot.\u003C\u002Fp\u003E\n\u003Ch3 id=\"wake-on-lan\"\u003Ewake on LAN\u003Ca href=\"#wake-on-lan\" class=\"anchor\"\u003E\u003Cspan class=\"visually-hidden\"\u003E#\u003C\u002Fspan\u003E\u003C\u002Fa\u003E\u003C\u002Fh3\u003E\u003Col\u003E\n\u003Cli\u003Econnect IPMI via ssh\u003C\u002Fli\u003E\n\u003Cli\u003E\u003Ccode\u003Ecd system1\u003C\u002Fcode\u003E\u003C\u002Fli\u003E\n\u003Cli\u003E\u003Ccode\u003Ecd pwrmgtsvc1\u003C\u002Fcode\u003E\u003C\u002Fli\u003E\n\u003Cli\u003E\u003Ccode\u003Eshow\u003C\u002Fcode\u003E\u003C\u002Fli\u003E\n\u003Cli\u003E\u003Ccode\u003Estart\u003C\u002Fcode\u003E # boot server\u003C\u002Fli\u003E\n\u003Cli\u003E\u003Ccode\u003Eshow\u003C\u002Fcode\u003E # power state 6 –&gt; 1\u003C\u002Fli\u003E\n\u003Cli\u003E\u003Ccode\u003Eexit\u003C\u002Fcode\u003E\u003C\u002Fli\u003E\n\u003C\u002Fol\u003E\n\u003Cp\u003E2 ~ 7 into \u003Ccode\u003Estart \u002Fsystem1\u002Fpwrmgtsvc1\u003C\u002Fcode\u003E\u003C\u002Fp\u003E\n"],"uses":{"params":["path","slug"]}}]}
