{"type":"data","nodes":[null,{"type":"data","data":[{"prev":1,"next":4,"section":7},{"slug":2,"title":3},"tech\u002Fstorage","Storage and RAM",{"slug":5,"title":6},"tech\u002Fprocessing_unit","Processing Unit",{"file":8,"title":9,"date":10,"summary":-1,"tag":11,"toc":14,"body":15},"tech\u002F10-display.md","Display","Jan. 31, 2023",[12,13],"hardware","display","\u003Ch4\u003EContents\u003C\u002Fh4\u003E\u003Cp class=\"toc-h2\"\u003E\u003Ca href=\"#lcd\"\u003ELCD\u003C\u002Fa\u003E\u003C\u002Fp\u003E\u003Cp class=\"toc-h2\"\u003E\u003Ca href=\"#oled\"\u003EOLED\u003C\u002Fa\u003E\u003C\u002Fp\u003E\u003Cp class=\"toc-h3\"\u003E\u003Ca href=\"#theory\"\u003ETheory\u003C\u002Fa\u003E\u003C\u002Fp\u003E\u003Cp class=\"toc-h3\"\u003E\u003Ca href=\"#w-oled\"\u003EW-OLED\u003C\u002Fa\u003E\u003C\u002Fp\u003E\u003Cp class=\"toc-h3\"\u003E\u003Ca href=\"#qd-oled\"\u003EQD-OLED\u003C\u002Fa\u003E\u003C\u002Fp\u003E\u003Cp class=\"toc-h2\"\u003E\u003Ca href=\"#microled\"\u003EMicroLED\u003C\u002Fa\u003E\u003C\u002Fp\u003E\u003Cp class=\"toc-h2\"\u003E\u003Ca href=\"#useful-resource\"\u003EUseful resource\u003C\u002Fa\u003E\u003C\u002Fp\u003E\u003Cp class=\"toc-h3\"\u003E\u003Ca href=\"#youtube\"\u003EYouTube\u003C\u002Fa\u003E\u003C\u002Fp\u003E\u003Cp class=\"toc-h3\"\u003E\u003Ca href=\"#blog\"\u003EBlog\u003C\u002Fa\u003E\u003C\u002Fp\u003E","\u003Caside class=\"chatgpt-base\"\u003E\u003Cdiv class=\"chatgpt-mark\"\u003EMark\u003C\u002Fdiv\u003E\u003Cdiv class=\"chatgpt-text\"\u003E\u003Cp\u003EThis article is based on generated information from ChatGPT.\u003C\u002Fp\u003E\n\u003C\u002Fdiv\u003E\u003C\u002Faside\u003E\u003Ch2 id=\"lcd\"\u003ELCD\u003Ca href=\"#lcd\" class=\"anchor\"\u003E\u003Cspan class=\"visually-hidden\"\u003E#\u003C\u002Fspan\u003E\u003C\u002Fa\u003E\u003C\u002Fh2\u003E\u003Cul\u003E\n\u003Cli\u003EPN, IPS, VA\u003C\u002Fli\u003E\n\u003C\u002Ful\u003E\n\u003Chr\u003E\n\u003Ch2 id=\"oled\"\u003EOLED\u003Ca href=\"#oled\" class=\"anchor\"\u003E\u003Cspan class=\"visually-hidden\"\u003E#\u003C\u002Fspan\u003E\u003C\u002Fa\u003E\u003C\u002Fh2\u003E\u003Cp\u003EOLED (Organic Light-Emitting Diode)\u003C\u002Fp\u003E\n\u003Ch3 id=\"theory\"\u003ETheory\u003Ca href=\"#theory\" class=\"anchor\"\u003E\u003Cspan class=\"visually-hidden\"\u003E#\u003C\u002Fspan\u003E\u003C\u002Fa\u003E\u003C\u002Fh3\u003E\u003Cp\u003ELight emission in OLEDs occurs through a process called electroluminescence. Here’s how it works:\u003C\u002Fp\u003E\n\u003Col\u003E\n\u003Cli\u003ETwo conductive layers are used as the cathode and anode. The cathode is typically made of a metal such as aluminum or calcium and the anode is made of a transparent material such as indium tin oxide (ITO).\u003C\u002Fli\u003E\n\u003Cli\u003EA thin layer of organic material is placed between the cathode and anode. This organic material is made up of small molecules or polymers that emit light when excited by an electric current.\u003C\u002Fli\u003E\n\u003Cli\u003EWhen a voltage is applied to the OLED, electrons flow from the cathode to the anode, passing through the organic material in the process.\u003C\u002Fli\u003E\n\u003Cli\u003EAs the electrons move through the organic material, they \u003Cstrong\u003Ecollide with holes (absence of electrons) and excite the organic molecules\u003C\u002Fstrong\u003E. This excitation causes the organic molecules to emit light through \u003Cstrong\u003Efluorescence or phosphorescence\u003C\u002Fstrong\u003E.\u003C\u002Fli\u003E\n\u003Cli\u003EThe color of the emitted light depends on the specific type of organic material used. Different materials can be combined to create OLEDs that emit different colors.\u003C\u002Fli\u003E\n\u003Cli\u003EThe emitted light then passes through the anode and can be seen by the user. This light emission is controlled by the current applied to the OLED, allowing for precise control over the display of images.\u003C\u002Fli\u003E\n\u003C\u002Fol\u003E\n\u003Cp\u003ELight emission in organic molecules in OLEDs occurs through a process called fluorescence or phosphorescence. Here’s how it works:\u003C\u002Fp\u003E\n\u003Col\u003E\n\u003Cli\u003EElectrons are excited by the electric current applied to the OLED, causing them to move to higher energy levels.\u003C\u002Fli\u003E\n\u003Cli\u003EIt becomes unstable and returns to its ground state, releasing the excess energy in the form of light.\u003C\u002Fli\u003E\n\u003Cli\u003EIn \u003Cstrong\u003Efluorescence\u003C\u002Fstrong\u003E, the excited electrons \u003Cem\u003Ereturn to the ground state quickly, emitting light almost instantly\u003C\u002Fem\u003E. Fluorescent OLEDs emit light with short lifetimes and are typically used in high-speed displays.\u003C\u002Fli\u003E\n\u003Cli\u003EIn \u003Cstrong\u003Ephosphorescence\u003C\u002Fstrong\u003E, the excited electrons have a longer lifetime and \u003Cem\u003Ereturn to the ground state more slowly. This slow return allows for a higher efficiency of light emission and longer lifetimes of the emitted light\u003C\u002Fem\u003E. Phosphorescent OLEDs are typically used in low-power displays, such as those in smartwatches or mobile phones.\u003C\u002Fli\u003E\n\u003Cli\u003EThe color of the light emitted by the organic molecules.\u003C\u002Fli\u003E\n\u003C\u002Fol\u003E\n\u003Cp\u003EIn phosphorescent OLEDs, the light emitted is more efficiently utilized, as the light can travel further before being absorbed.\u003C\u002Fp\u003E\n\u003Cp\u003EIn summary, W-OLEDs are typically used for their bright and even white light, while QD-OLEDs are used for their improved color accuracy and reduced power consumption.\u003C\u002Fp\u003E\n\u003Ch3 id=\"w-oled\"\u003EW-OLED\u003Ca href=\"#w-oled\" class=\"anchor\"\u003E\u003Cspan class=\"visually-hidden\"\u003E#\u003C\u002Fspan\u003E\u003C\u002Fa\u003E\u003C\u002Fh3\u003E\u003Cp\u003EW-OLEDs are OLED displays that use a white light-emitting material as the backlight source. This allows the display to produce a bright and even white light, which can be filtered to produce different colors. W-OLEDs are commonly used in television displays, as they offer high brightness and color saturation.\u003C\u002Fp\u003E\n\u003Ch3 id=\"qd-oled\"\u003EQD-OLED\u003Ca href=\"#qd-oled\" class=\"anchor\"\u003E\u003Cspan class=\"visually-hidden\"\u003E#\u003C\u002Fspan\u003E\u003C\u002Fa\u003E\u003C\u002Fh3\u003E\u003Cp\u003EQD-OLEDs, on the other hand, use quantum dots as the light-emitting material. Quantum dots are tiny semiconductor particles that emit light when excited by an electric current. QD-OLEDs have several advantages over traditional OLED displays, including higher color gamut, improved brightness, and reduced power consumption.\u003C\u002Fp\u003E\n\u003Chr\u003E\n\u003Ch2 id=\"microled\"\u003EMicroLED\u003Ca href=\"#microled\" class=\"anchor\"\u003E\u003Cspan class=\"visually-hidden\"\u003E#\u003C\u002Fspan\u003E\u003C\u002Fa\u003E\u003C\u002Fh2\u003E\u003Cp\u003EMicroLED is a type of display technology that uses tiny light-emitting diodes, each less than 100 micrometers in size, to create high-resolution images.\u003C\u002Fp\u003E\n\u003Cp\u003EIn a microLED display, each microLED acts as an individual pixel, allowing for a high degree of control over the intensity and color of each pixel.\u003C\u002Fp\u003E\n\u003Chr\u003E\n\u003Ch2 id=\"useful-resource\"\u003EUseful resource\u003Ca href=\"#useful-resource\" class=\"anchor\"\u003E\u003Cspan class=\"visually-hidden\"\u003E#\u003C\u002Fspan\u003E\u003C\u002Fa\u003E\u003C\u002Fh2\u003E\u003Ch3 id=\"youtube\"\u003EYouTube\u003Ca href=\"#youtube\" class=\"anchor\"\u003E\u003Cspan class=\"visually-hidden\"\u003E#\u003C\u002Fspan\u003E\u003C\u002Fa\u003E\u003C\u002Fh3\u003E\u003Cul\u003E\n\u003Cli\u003E\u003Ca href=\"\"\u003EColor Scale\u003C\u002Fa\u003E\u003C\u002Fli\u003E\n\u003C\u002Ful\u003E\n\u003Ch3 id=\"blog\"\u003EBlog\u003Ca href=\"#blog\" class=\"anchor\"\u003E\u003Cspan class=\"visually-hidden\"\u003E#\u003C\u002Fspan\u003E\u003C\u002Fa\u003E\u003C\u002Fh3\u003E\u003Cul\u003E\n\u003Cli\u003E\u003Ca href=\"\"\u003ELG Display Blog\u003C\u002Fa\u003E\u003C\u002Fli\u003E\n\u003Cli\u003E\u003Ca href=\"\"\u003ESamsung Display Blog\u003C\u002Fa\u003E\u003C\u002Fli\u003E\n\u003C\u002Ful\u003E\n"],"uses":{"params":["path","slug"]}}]}
